var __main = function() {
  // 新感悟
  // es6 的新特性要经常使用 不然会忘记
  // 两部分,
  // 1. 已有的升级或扩展(1-9)
  // 2. 增加新功能(10-28)

  // 1. ECMAscript 的历史
  // 2. 声明后才能使用 let、const
  // 3. 块级作用域 let、const 在声明前使用全局变量会得到错误,
  // 4. 暂时性死区意味着 typeof 检测会有危险
  // 5. 不允许重复声明同一个变量
  // 6. 块级作用域的作用是函数作用域不会覆盖全局作用域
  // 7. var 声明变量会出现变量提升至当前作用域的最顶部
  // 8. var 没有在函数作用域内会泄漏为全局变量
  // 9. ES6 的块级作用域是外部的代码块不受内部代码块影响
  // 10. 函数声明会产生函数提升
  // 11. const 声明一个只读的变量, 一旦声明,常量的值不能改变,且不能之后赋值,只有声明得立即初始化
  // 12. const 和 let 只能在作用域内有效
  // 13. const 保存的是指针, 而内存中的数据结构是不能控制的
  // 14. 声明变量的方法：var, function,[es5] let, const, import, class[es6]
  // 15. 顶层对象的属性：浏览器是指 window, Node 指的是 global对象,顶层对象与全局对象等价
  // 16.  
}
